{
  "cli": {
    "service-type": "cli",
    "description": "Core codebase for the infra-buddy commandline interface."
  },
  "cloudfront-angular": {
    "service-type": "service-template",
    "description": "A CloudFormation template that creates a CloudFront distribution configured for an Angular 2+ web app. Optimized for infra-buddy"
  },
  "cluster": {
    "service-type": "service-template",
    "description": "CloudFormation template for deploying a ECS cluster with an application load balancer. Optimized for use with infra-buddy."
  },
  "ecs-service": {
    "service-type": "service-template",
    "description": "A unified template for creating an ECS service that can act as an API or a headless service. Optimized for use with InfraBuddy"
  },
  "rds-aurora": {
    "service-type": "service-template",
    "description": "CloudFormation template for deploying a RDS aurora cluster. Optimized for use with infra-buddy."
  },
  "vpc": {
    "service-type": "service-template",
    "description": "CloudFormation template for deploying a vpc with public and private subnets. Optimized for use with infra-buddy."
  },
  "cluster-cpu-autoscale": {
    "service-type": "service-modification-template",
    "description": "CloudFormation template for configuring autoscale for an ECS cluster based on CPU usage. Optimized for use with infra-buddy."
  },
  "cluster-memory-autoscale": {
    "service-type": "service-modification-template",
    "description": "CloudFormation template for configuring autoscale for an ECS cluster based on Memory usage. Optimized for use with infra-buddy."
  },
  "ecs-service-autoscale": {
    "service-type": "service-modification-template",
    "description": "CloudFormation template for deploying autoscaling an ECS service. Optimized for use with infra-buddy."
  },
  "ecs-service-sqs-threshold": {
    "service-type": "service-modification-template",
    "description": "CloudFormation template for deploying autoscaling an ECS service. Optimized for use with infra-buddy."
  },
  "ecs-service-target-connection-error": {
    "service-type": "service-modification-template",
    "description": "CloudFormation template for configuring autoscale for an ECS service based on number of errors generated by connected application ELB. Optimized for use with infra-buddy."
  }

}